Jason-bandy/AIVoicePrinter/rtt-bk7251-fullcode/beken378/driver/gpio/gpio.c
#include "include.h"
#include "arm_arch.h"
#include "gpio_pub.h"
#include "gpio.h"
#include "drv_model_pub.h"
#include "sys_ctrl_pub.h"
#include "uart_pub.h"
#include "intc_pub.h"
#include "icu_pub.h"

static GPIO_FUNC_PTR p_gpio_intr_handler[GPIONUM];

static SDD_OPERATIONS gpio_op =
{
    gpio_ctrl
};
static int gpio_ops_filter_flag = 0;

void gpio_isr(void)
{
    int i;
    unsigned long ulIntStatus;
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	ulIntStatus = *(volatile UINT32 *)REG_GPIO_INTSTA;
    for (i = 0; i <= GPIO31; i++)
    {
        if (ulIntStatus & (0x01UL << i))
        {
            if (p_gpio_intr_handler[i] != NULL)
            {
                (void)p_gpio_intr_handler[i]((unsigned char)(i + GPIO0));
            }
        }
    }

    *(volatile UINT32 *)REG_GPIO_INTSTA = ulIntStatus;

	ulIntStatus = *(volatile UINT32 *)REG_GPIO_INTSTA2;
    for (i = 0; i < (GPIONUM - GPIO32); i++)
    {
        if (ulIntStatus & (0x01UL << i))
        {
            if (p_gpio_intr_handler[(i + GPIO32)] != NULL)
            {
                (void)p_gpio_intr_handler[(i + GPIO32)]((unsigned char)(i + GPIO32));
            }
        }
    }

    *(volatile UINT32 *)REG_GPIO_INTSTA2 = ulIntStatus;
#else
    ulIntStatus = *(volatile UINT32 *)REG_GPIO_INTSTA;
    for (i = 0; i < GPIONUM; i++)
    {
        if (ulIntStatus & (0x01UL << i))
        {
            if (p_gpio_intr_handler[i] != NULL)
            {
                (void)p_gpio_intr_handler[i]((unsigned char)i);
            }
        }
    }

    *(volatile UINT32 *)REG_GPIO_INTSTA = ulIntStatus;
#endif
}

static UINT32 gpio_ops_filter(UINT32 index)
{
    UINT32 ret;

    ret = GPIO_FAILURE;

#ifdef JTAG_GPIO_FILTER
    if(gpio_ops_filter_flag)
    {
        return ret;
    }

    if((GPIO20 == index)
            || (GPIO21 == index)
            || (GPIO22 == index)
            || (GPIO23 == index))
    {
        FATAL_PRT("[JTAG]gpio_filter_%d\r\n", index);
        ret = GPIO_SUCCESS;

        goto filter_exit;
    }
#endif

#ifdef JTAG_GPIO_FILTER
filter_exit:
#endif

    return ret;
}

void gpio_ops_disable_filter(void)
{
    gpio_ops_filter_flag = 1;
}

#if (SOC_BK7221U == CFG_SOC_NAME)
UINT32 gpio_get_config(UINT32 index, UINT32 *mode)
{
	uint32_t reg, ret;
	uint32_t id, val;

	ret = GPIO_SUCCESS;
	if(index < GPIO16)
	{
		reg = REG_GPIO_FUNC_CFG;
		id = index;
	}
	else if(index < GPIO32)
	{
		reg = REG_GPIO_FUNC_CFG_2;
		id = index - 16;
	}
	else if(index < GPIONUM)
	{
		reg = REG_GPIO_FUNC_CFG_3;
		id = index - 32;
	}
	else
	{
		ret = GPIO_FAILURE;
		goto get_exit;
	}

	val = REG_READ(reg);
	*mode = (val >> (id << 1)) & 0x3;

get_exit:
	return ret;
}
#endif

void gpio_config(UINT32 index, UINT32 mode)
{
    UINT32 val;
    UINT32 overstep = 0;
    volatile UINT32 *gpio_cfg_addr;

    if(GPIO_SUCCESS == gpio_ops_filter(index))
    {
        goto cfg_exit;
    }

    if(index >= GPIONUM)
    {
        WARN_PRT("gpio_id_cross_border\r\n");

        goto cfg_exit;
    }
    
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	if(index < GPIO32) {
	    gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + index * 4);
	}
	else if(index >= GPIO32) {
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_32_CONFIG + (index - 32) * 4);
	}
#else
    gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + index * 4);
#endif

    switch(mode)
    {
    case GMODE_INPUT_PULLDOWN:
        val = 0x2C;
        break;

    case GMODE_OUTPUT:
        val = 0x00;
        break;

    case GMODE_SECOND_FUNC:
        val = 0x48;
        break;

    case GMODE_INPUT_PULLUP:
        val = 0x3C;
        break;

    case GMODE_INPUT:
        val = 0x0C;
        break;
	
    case GMODE_SECOND_FUNC_PULL_UP:
        val = 0x78;
        break;

    case GMODE_DEEP_PS:
	case GMODE_SET_HIGH_IMPENDANCE:
		val = 0x08;
		break;
	
    default:
        overstep = 1;
        WARN_PRT("gpio_mode_exception:%d\r\n", mode);
        break;
    }

    if(0 == overstep)
    {
        REG_WRITE(gpio_cfg_addr, val);
    }

cfg_exit:
    return;
}

#if ((SOC_BK7231U == CFG_SOC_NAME) || (SOC_BK7221U == CFG_SOC_NAME))
void gpio_usb_second_function(void)
{
    UINT32 val;

	val = REG_READ(REG_GPIO_FUNC_CFG_2);
	val &= (~(GPIO_PCFG2_MASK(GPIO_USB_DP_PIN)
                | GPIO_PCFG2_MASK(GPIO_USB_DN_PIN)));
	val |= ( GPIO_PCFG2_2_FUNC(GPIO_USB_DP_PIN)
                | GPIO_PCFG2_2_FUNC(GPIO_USB_DN_PIN));
                            
	REG_WRITE(REG_GPIO_FUNC_CFG_2, val);
}
#endif 

static void gpio_enable_second_function(UINT32 func_mode)
{
    UINT32 i;
    UINT32 reg;
    UINT32 modul_select = GPIO_MODUL_NONE;
    UINT32 pmode = PERIAL_MODE_1;
    UINT32 pmask = 0;
    UINT32 end_index = 0;
    UINT32 start_index = 0;
    UINT32 config_mode = GMODE_SECOND_FUNC;

#if ((SOC_BK7231U == CFG_SOC_NAME) || (SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231N == CFG_SOC_NAME))
    UINT32 regist = 0, shift = 0;
#endif // (CFG_SOC_NAME != SOC_BK7231)

    switch(func_mode)
    {
    case GFUNC_MODE_UART2:
        start_index = 0;
        end_index = 1;
        pmode = PERIAL_MODE_1;
        config_mode = GMODE_SECOND_FUNC_PULL_UP;
        break;

    case GFUNC_MODE_I2C2:
        start_index = 0;
        end_index = 1;
        pmode = PERIAL_MODE_2;
		config_mode = GMODE_SECOND_FUNC_PULL_UP;
        break;

    case GFUNC_MODE_I2S:
        start_index = 2;
        end_index = 5;
        pmode = PERIAL_MODE_1;
        break;

    case GFUNC_MODE_ADC1:
#if (SOC_BK7231N == CFG_SOC_NAME)
        start_index = 26;
        end_index = 26;
        pmode = PERIAL_MODE_1;
        config_mode = GMODE_SET_HIGH_IMPENDANCE;
#else
        start_index = 4;
        end_index = 4;
        pmode = PERIAL_MODE_2;
#endif
        break;

    case GFUNC_MODE_ADC2:
#if (SOC_BK7231N == CFG_SOC_NAME)
        start_index = 24;
        end_index = 24;
        pmode = PERIAL_MODE_3;
        config_mode = GMODE_SET_HIGH_IMPENDANCE;
#else
        start_index = 5;
        end_index = 5;
        pmode = PERIAL_MODE_2;
#endif
        break;

    case GFUNC_MODE_CLK13M:
        start_index = 6;
        end_index = 6;
        pmode = PERIAL_MODE_1;
        break;

    case GFUNC_MODE_PWM0:
        start_index = 6;
        end_index = 6;
        pmode = PERIAL_MODE_2;
        break;

    case GFUNC_MODE_PWM1:
        start_index = 7;
        end_index = 7;
        pmode = PERIAL_MODE_2;
        break;

