Jason-bandy/AIVoicePrinter/rtt-bk7251-fullcode/beken378/driver/gpio/gpio.c
    case GFUNC_MODE_PWM2:
        start_index = 8;
        end_index = 8;
        pmode = PERIAL_MODE_2;
        break;

    case GFUNC_MODE_PWM3:
        start_index = 9;
        end_index = 9;
        pmode = PERIAL_MODE_2;
        break;

    case GFUNC_MODE_BT_PRIORITY:
        start_index = 9;
        end_index = 9;
        pmode = PERIAL_MODE_1;
        break;

    case GFUNC_MODE_WIFI_ACTIVE:
        start_index = 7;
        end_index = 7;
        pmode = PERIAL_MODE_1;
        break;

    case GFUNC_MODE_BT_ACTIVE:
        start_index = 8;
        end_index = 8;
        pmode = PERIAL_MODE_1;
        break;

    case GFUNC_MODE_UART1:
        start_index = 10;
        end_index = 13;
        pmode = PERIAL_MODE_1;
        config_mode = GMODE_SECOND_FUNC_PULL_UP;
        break;

    case GFUNC_MODE_SD_DMA:
        start_index = 14;
        end_index = 19;
        pmode = PERIAL_MODE_1;
        modul_select = GPIO_SD_DMA_MODULE;
        pmask = GPIO_SD_MODULE_MASK;
        break;

	/* P34-39 SDIO */
    case GFUNC_MODE_SD1_DMA:
        start_index = 34;
        end_index = 39;
        pmode = PERIAL_MODE_2;
        modul_select = GPIO_SD1_DMA_MODULE;
        pmask = GPIO_SD_MODULE_MASK;
        break;

    case GFUNC_MODE_SD_HOST:
        start_index = 14;
        end_index = 19;
        pmode = PERIAL_MODE_1;
        config_mode = GMODE_SECOND_FUNC_PULL_UP;
        modul_select = GPIO_SD_HOST_MODULE;
        pmask = GPIO_SD_MODULE_MASK;
        break;

    case GFUNC_MODE_SPI_DMA:
        start_index = 14;
        end_index = 17;
        pmode = PERIAL_MODE_2;
        modul_select = GPIO_SPI_DMA_MODULE;
        pmask = GPIO_SPI_MODULE_MASK;
        break;

    case GFUNC_MODE_SPI:
        start_index = 14;
        end_index = 17;
        pmode = PERIAL_MODE_2;
        modul_select = GPIO_SPI_MODULE;
        pmask = GPIO_SPI_MODULE_MASK;
        break;

    case GFUNC_MODE_SPI_GPIO_14:
        start_index = 14;
        end_index = 14;
        pmode = PERIAL_MODE_2;
        modul_select = GPIO_SPI_MODULE;
        pmask = GPIO_SPI_MODULE_MASK;
        break;

    case GFUNC_MODE_SPI_GPIO_16_17:
        start_index = 16;
        end_index = 17;
        pmode = PERIAL_MODE_2;
        modul_select = GPIO_SPI_MODULE;
        pmask = GPIO_SPI_MODULE_MASK;
        break;

    case GFUNC_MODE_PWM4:
#if (CFG_SOC_NAME == SOC_BK7231)
        start_index = 18;
        end_index = 18;
#else
        start_index = 24;
        end_index = 24;
#endif
        pmode = PERIAL_MODE_2;
        break;

    case GFUNC_MODE_PWM5:
#if (CFG_SOC_NAME == SOC_BK7231)
        start_index = 19;
        end_index = 19;
#else
        start_index = 26;
        end_index = 26;
#endif
        pmode = PERIAL_MODE_2;
        break;

    case GFUNC_MODE_I2C1:
        start_index = 20;
        end_index = 21;
        pmode = PERIAL_MODE_1;
        config_mode = GMODE_SECOND_FUNC_PULL_UP;
        break;

    case GFUNC_MODE_JTAG:
        start_index = 20;
        end_index = 23;
        pmode = PERIAL_MODE_2;
        break;

    case GFUNC_MODE_CLK26M:
        start_index = 22;
        end_index = 22;
        pmode = PERIAL_MODE_1;
        break;

    case GFUNC_MODE_ADC3:
        start_index = 23;
        end_index = 23;
        pmode = PERIAL_MODE_1;
        break;

#if ((SOC_BK7231U == CFG_SOC_NAME) || (SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231N == CFG_SOC_NAME))
    case GFUNC_MODE_DCMI:
        start_index = 27;
        end_index = 39;
        pmode = PERIAL_MODE_1;
        break;

    case GFUNC_MODE_ADC4:
#if (SOC_BK7231N == CFG_SOC_NAME)
        start_index = 28;
        end_index = 28;
        pmode = PERIAL_MODE_2;
        config_mode = GMODE_SET_HIGH_IMPENDANCE;
#else
        start_index = 2;
        end_index = 2;
        pmode = PERIAL_MODE_2;
#endif
        break;

    case GFUNC_MODE_ADC5:
#if (SOC_BK7231N == CFG_SOC_NAME)
        start_index = 22;
        end_index = 22;
        pmode = PERIAL_MODE_1;
        config_mode = GMODE_SET_HIGH_IMPENDANCE;
#else
        start_index = 3;
        end_index = 3;
        pmode = PERIAL_MODE_2;
#endif
        break;

    case GFUNC_MODE_ADC6:
#if (SOC_BK7231N == CFG_SOC_NAME)
        start_index = 21;
        end_index = 21;
        pmode = PERIAL_MODE_1;
        config_mode = GMODE_SET_HIGH_IMPENDANCE;
#else
        start_index = 12;
        end_index = 12;
        pmode = PERIAL_MODE_2;
#endif
        break;

   case GFUNC_MODE_ADC7:
        start_index = 13;
        end_index = 13;
        pmode = PERIAL_MODE_2;
        break;
        
    case GFUNC_MODE_SD1_HOST:
        start_index = 34;
        end_index = 39;
        pmode = PERIAL_MODE_2;
        config_mode = GMODE_SECOND_FUNC_PULL_UP;
        modul_select = GPIO_SD1_HOST_MODULE;
        pmask = GPIO_SD_MODULE_MASK;
        break;

    case GFUNC_MODE_SPI1:
        start_index = 30;
        end_index = 33;
        pmode = PERIAL_MODE_2;
        modul_select = GPIO_SPI1_MODULE;
        pmask = GPIO_SPI_MODULE_MASK;
        break;
        
    case GFUNC_MODE_SPI_DMA1:
        start_index = 30;
        end_index = 33;
        pmode = PERIAL_MODE_2;
        modul_select = GPIO_SPI1_DMA_MODULE;
        pmask = GPIO_SPI_MODULE_MASK;
        break;
		
    case GFUNC_MODE_QSPI_1LINE:
        start_index = 16;
        end_index = 17;
        pmode = PERIAL_MODE_3;
		config_mode = GMODE_SECOND_FUNC_PULL_UP;
        break;

	case GFUNC_MODE_QSPI_4LINE:
        start_index = 18;
        end_index = 19;
        pmode = PERIAL_MODE_2;
        break;    
		
	case GFUNC_MODE_QSPI_CLK:
        start_index = 24;
        end_index = 24;
        pmode = PERIAL_MODE_3;
        break;	
		
	case GFUNC_MODE_QSPI_CSN:
        start_index = 26;
        end_index = 26;
        pmode = PERIAL_MODE_3;
        break;
	case GFUNC_MODE_IRDA:
		start_index = 26;
        end_index = 26;
        pmode = PERIAL_MODE_1;
        break;
        
