Jason-bandy/AIVoicePrinter/rtt-bk7251-fullcode/beken378/driver/gpio/gpio.c
#endif // (CFG_SOC_NAME != SOC_BK7231)

    case GFUNC_MODE_TXEN:
#if (SOC_BK7231N == CFG_SOC_NAME)
        start_index = 22;
        end_index = 22;
        pmode = PERIAL_MODE_3;
#endif
        break;

    case GFUNC_MODE_RXEN:
#if (SOC_BK7231N == CFG_SOC_NAME)
        start_index = 28;
        end_index = 28;
        pmode = PERIAL_MODE_1;
#endif
        break;

    default:
        break;
    }

    for(i = start_index; i <= end_index; i++)
    {
        #if ((SOC_BK7231U == CFG_SOC_NAME) || (SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231N == CFG_SOC_NAME))
        if((func_mode == GFUNC_MODE_DCMI) && (i == GPIO28))
            continue;        
        #endif // (CFG_SOC_NAME != SOC_BK7231)
        
        #if ((SOC_BK7231U == CFG_SOC_NAME) || (SOC_BK7221U == CFG_SOC_NAME))
        if(i < GPIO16) {
            regist = REG_GPIO_FUNC_CFG;
            shift = i * 2;
        }
        else if(i < GPIO32) {
            regist = REG_GPIO_FUNC_CFG_2;
            shift = (i - 16) * 2;
        }
        else if(i < GPIONUM) {
            regist = REG_GPIO_FUNC_CFG_3;
            shift = (i - 32) * 2;
        }
        reg = REG_READ(regist);

        reg = (reg & ~(0x3u << shift)) | ((pmode & 0x3u) << shift);
        REG_WRITE(regist, reg);
        #elif (SOC_BK7231N == CFG_SOC_NAME)
        if(i < GPIO16) {
            regist = REG_GPIO_FUNC_CFG;
            shift = i * 2;
        }
        else if(i < GPIONUM) {
            regist = REG_GPIO_FUNC_CFG_2;
            shift = (i - 16) * 2;
        }
        reg = REG_READ(regist);

        reg = (reg & ~(0x3u << shift)) | ((pmode & 0x3u) << shift);
        REG_WRITE(regist, reg);
        #else
        reg = REG_READ(REG_GPIO_FUNC_CFG);
        if(PERIAL_MODE_1 == pmode)
        {
            reg &= ~(BIT(i));
        }
        else /*(PERIAL_MODE_2 == pmode)*/
        {
            reg |= BIT(i);
        }
        REG_WRITE(REG_GPIO_FUNC_CFG, reg);
        #endif // (CFG_SOC_NAME != SOC_BK7231)

	    gpio_config(i, config_mode);
    }


    if(modul_select != GPIO_MODUL_NONE)
    {
        reg = REG_READ(REG_GPIO_MODULE_SELECT);
        reg &= ~ (pmask);
        reg |= modul_select;
        REG_WRITE(REG_GPIO_MODULE_SELECT, reg);
    }
    return;
}

UINT32 gpio_input(UINT32 id)
{
    UINT32 val = 0;
    volatile UINT32 *gpio_cfg_addr;

    if(GPIO_SUCCESS == gpio_ops_filter(id))
    {
        WARN_PRT("gpio_input_fail\r\n");
        goto input_exit;
    }
	
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	if(id <= GPIO31) {
	    gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + id * 4);
	}
	else if(id >= GPIO32) {
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_32_CONFIG + (id - 32) * 4);
	}
#else
    gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + id * 4);
#endif

    val = REG_READ(gpio_cfg_addr);

input_exit:
    return (val & GCFG_INPUT_BIT);
}

void gpio_output(UINT32 id, UINT32 val)
{
    UINT32 reg_val;
    volatile UINT32 *gpio_cfg_addr;

    if(GPIO_SUCCESS == gpio_ops_filter(id))
    {
        WARN_PRT("gpio_output_fail\r\n");
        goto output_exit;
    }
	
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	if(id <= GPIO31) {
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + id * 4);
	}
	else if(id >= GPIO32) {
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_32_CONFIG + (id - 32) * 4);
	}
#else
    gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + id * 4);
#endif
	
    reg_val = REG_READ(gpio_cfg_addr);

    reg_val &= ~GCFG_OUTPUT_BIT;
    reg_val |= (val & 0x01) << GCFG_OUTPUT_POS;
    REG_WRITE(gpio_cfg_addr, reg_val);

output_exit:
    return;
}

void gpio_get_output(UINT32 id, UINT32 *val)
{
    UINT32 reg_val;
    volatile UINT32 *gpio_cfg_addr;

    if(GPIO_SUCCESS == gpio_ops_filter(id))
    {
        WARN_PRT("gpio_get_output_fail\r\n");
        goto output_exit;
    }

	if (!val)
		goto output_exit;
	
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	if(id <= GPIO31) {
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + id * 4);
	}
	else if(id >= GPIO32) {
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_32_CONFIG + (id - 32) * 4);
	}
#else
    gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + id * 4);
#endif
	
    reg_val = REG_READ(gpio_cfg_addr);

	if (reg_val & GCFG_OUTPUT_BIT)
		*val = 1;
	else
		*val = 0;

output_exit:
    return;
}

void gpio_get_dir(UINT32 index, UINT32 *val)
{
	UINT32 value;
	volatile UINT32 *gpio_cfg_addr;

	if ((NULL == val) || (index >= GPIONUM)) {
		WARN_PRT("gpio_get_dir param err\r\n");

		goto cfg_exit;
	}

#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	if (index < GPIO32)
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + index * 4);
	else if (index >= GPIO32)
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_32_CONFIG + (index - 32) * 4);
#else
	gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + index * 4);
#endif

	value = REG_READ(gpio_cfg_addr);
	if ((value & 0x0C) == 0x0C)
		*val = GPIO_DIR_INPUT;
	else if ((value & 0x0C) == 0x00)
		*val = GPIO_DIR_OUTPUT;
	else
		*val = GPIO_DIR_OTHER;

cfg_exit:
	return;
}

void gpio_int_mask(UINT32 index, UINT32 mask)
{
	if (mask) {
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
		if (index <= GPIO31)
			*(volatile UINT32 *)REG_GPIO_INTEN &= ~(0x01U << index);
		else if (index >= GPIO32)
			*(volatile UINT32 *)REG_GPIO_INTEN2 &= ~(0x01U << (index - 32));
#else
		*(volatile UINT32 *)REG_GPIO_INTEN &= ~(0x01U << index);
#endif
	} else {
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
		if (index <= GPIO31)
			*(volatile UINT32 *)REG_GPIO_INTEN |= (0x01U << index);
		else if (index >= GPIO32)
			*(volatile UINT32 *)REG_GPIO_INTEN2 |= (0x01U << (index - GPIO32));
#else
		*(volatile UINT32 *)REG_GPIO_INTEN |= (0x01 << index);
#endif
	}
}

static void gpio_output_reverse(UINT32 id)
{
	UINT32 reg_val;
	volatile UINT32 *gpio_cfg_addr;

	if (GPIO_SUCCESS == gpio_ops_filter(id)) {
		WARN_PRT("gpio_output_reverse_fail\r\n");
		goto reverse_exit;
	}

#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	if (id <= GPIO31)
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + id * 4);
	else if (id >= GPIO32)
		gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_32_CONFIG + (id - 32) * 4);
#else
	gpio_cfg_addr = (volatile UINT32 *)(REG_GPIO_CFG_BASE_ADDR + id * 4);
#endif

	reg_val = REG_READ(gpio_cfg_addr);
	reg_val ^= GCFG_OUTPUT_BIT;
	REG_WRITE(gpio_cfg_addr, reg_val);

