Jason-bandy/AIVoicePrinter/rtt-bk7251-fullcode/beken378/driver/gpio/gpio.c
reverse_exit:
	return;
}

static void gpio_disable_jtag(void)
{
#ifndef JTAG_GPIO_FILTER
    int id;

    /*config GPIO_PCFG*/
    //#error "todo"

    for(id = GPIO20; id <= GPIO23; id ++)
    {
        //gpio_config(id, GMODE_OUTPUT);
    }
#endif
}

void gpio_test_isr(unsigned char ucChannel)
{
    gpio_output(4, 1);      // 161ms
}

void gpio_int_disable(UINT32 index)
{
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	if(index <= GPIO31) {
	    *(volatile UINT32 *)REG_GPIO_INTEN &= ~(0x01U << index);
	}
	else if(index >= GPIO32) {
		 *(volatile UINT32 *)REG_GPIO_INTEN2 &= ~(0x01U << (index - 32));
	}
#else
	*(volatile UINT32 *)REG_GPIO_INTEN &= ~(0x01U << index);
#endif
}

void gpio_int_enable(UINT32 index, UINT32 mode, GPIO_FUNC_PTR p_int_handler)
{
    UINT32 param;

    intc_service_register(IRQ_GPIO, PRI_IRQ_GPIO, gpio_isr);
    param = IRQ_GPIO_BIT;
    sddev_control(ICU_DEV_NAME, CMD_ICU_INT_ENABLE, &param);

    if(index >= GPIONUM)
    {
        WARN_PRT("gpio_id_cross_border\r\n");
        return;
    }

    mode &= 0x03;
    if ((mode == 0) || (mode == 3))
    {
        gpio_config(index, GMODE_INPUT_PULLUP);
    }
    else
    {
        gpio_config(index, GMODE_INPUT_PULLDOWN);
    }

    if (index <= GPIO15) {
        *(volatile UINT32 *)REG_GPIO_INTLV0 = (*(volatile UINT32 *)REG_GPIO_INTLV0 & (~(0x03 << (index << 1)))) | (mode << (index << 1));
    }
#if ((SOC_BK7231N != CFG_SOC_NAME))
    else  if ((index >= GPIO16) &&(index <= GPIO31))
#else
    else  if ((index >= GPIO16) && (index < GPIONUM))
#endif
	{
        *(volatile UINT32 *)REG_GPIO_INTLV1 = (*(volatile UINT32 *)REG_GPIO_INTLV1 & (~(0x03 << ((index - 16) << 1)))) | (mode << ((index - 16) << 1));
    }
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	else  if ((index >= GPIO32) &&(index <= GPIO39)) {
		*(volatile UINT32 *)REG_GPIO_INTLV3 = (*(volatile UINT32 *)REG_GPIO_INTLV3 & (~(0x03U << ((index - 32) << 1)))) | (mode << ((index - 32) << 1));
	}
#endif

    p_gpio_intr_handler[index] = p_int_handler;
#if ((SOC_BK7221U == CFG_SOC_NAME) || (SOC_BK7231U == CFG_SOC_NAME))
	if(index <= GPIO31) {
		*(volatile UINT32 *)REG_GPIO_INTEN |= (0x01U << index);
	}
	else if(index >= GPIO32) {
		*(volatile UINT32 *)REG_GPIO_INTEN2 |= (0x01U << (index - GPIO32));
	}
#else
    *(volatile UINT32 *)REG_GPIO_INTEN |= (0x01 << index);
#endif
}

/*******************************************************************/
void gpio_init(void)
{
#if CFG_SYS_START_TIME
    UINT32 param;
#endif
    gpio_disable_jtag();

    sddev_register_dev(GPIO_DEV_NAME, &gpio_op);
#if CFG_SYS_START_TIME
    param = 3 | (GMODE_OUTPUT << 8);
    gpio_ctrl(CMD_GPIO_CFG, &param);
    gpio_output(3, 0);					//141ms  delta time = 13ms
    param = 4 | (GMODE_OUTPUT << 8);
    gpio_ctrl(CMD_GPIO_CFG, &param);
    gpio_output(4, 0);
    param = 5 | (GMODE_OUTPUT << 8);
    gpio_ctrl(CMD_GPIO_CFG, &param);
    gpio_output(5, 0);

    intc_service_register(IRQ_GPIO, PRI_IRQ_GPIO, gpio_isr);
    param = IRQ_GPIO_BIT;
    sddev_control(ICU_DEV_NAME, CMD_ICU_INT_ENABLE, &param);

    gpio_int_enable(2, 2, gpio_test_isr);
    gpio_output(3, 1);					// delta time = 3.1ms, delta time = 780us
#endif
}

void gpio_exit(void)
{
    sddev_unregister_dev(GPIO_DEV_NAME);
}

UINT32 gpio_ctrl(UINT32 cmd, void *param)
{
    UINT32 ret;
    ret = GPIO_SUCCESS;

    switch(cmd)
    {
    case CMD_GPIO_CFG:
    {
        UINT32 id;
        UINT32 mode;

        id = GPIO_CFG_PARAM_DEMUX_ID(*(UINT32 *)param);
        mode = GPIO_CFG_PARAM_DEMUX_MODE(*(UINT32 *)param);

        gpio_config(id, mode);

        break;
    }

    case CMD_GPIO_OUTPUT_REVERSE:
        ASSERT(param);

        gpio_output_reverse(*(UINT32 *)param);
        break;

    case CMD_GPIO_OUTPUT:
    {
        UINT32 id;
        UINT32 val;

        id = GPIO_OUTPUT_DEMUX_ID(*(UINT32 *)param);
        val = GPIO_OUTPUT_DEMUX_VAL(*(UINT32 *)param);

        gpio_output(id, val);
        break;
    }

    case CMD_GPIO_INPUT:
    {
        UINT32 id;
        UINT32 val;

        ASSERT(param);

        id = *(UINT32 *)param;
        val = gpio_input(id);

        ret = val;
        break;
    }

    case CMD_GPIO_ENABLE_SECOND:
    {
        UINT32 second_mode;

        ASSERT(param);

        second_mode = *(UINT32 *)param;
        gpio_enable_second_function(second_mode);
        break;
    }
    
#if (SOC_BK7231 == CFG_SOC_NAME)
    case CMD_GPIO_CLR_DPLL_UNLOOK_INT_BIT:
        REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, DPLL_UNLOCK_INT);
        break;
#else
    case CMD_GPIO_CLR_DPLL_UNLOOK_INT_BIT:
    {
        UINT32 reg = REG_READ(REG_GPIO_EXTRAL_INT_CFG);
        reg &= ~GPIO_EXTRAL_INT_MASK;
        reg |= DPLL_UNLOCK_INT;
        REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);
        break;
    }
        
    case CMD_GPIO_EN_DPLL_UNLOOK_INT:
    {
        UINT32 reg = REG_READ(REG_GPIO_EXTRAL_INT_CFG);
        ASSERT(param);
        UINT32 enable = *(UINT32 *)param;
        if(enable) {
            reg &= ~GPIO_EXTRAL_INT_MASK;
            reg |= DPLL_UNLOCK_INT_EN;
            REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);
        } else {
            reg &= ~GPIO_EXTRAL_INT_MASK;
            reg &= ~DPLL_UNLOCK_INT_EN;
            REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);
        }
        break;
    }
#if (SOC_BK7221U == CFG_SOC_NAME)
    case CMD_GPIO_EN_USB_PLUG_IN_INT:
    {
        INT32 reg = REG_READ(REG_GPIO_EXTRAL_INT_CFG);
        ASSERT(param);
        UINT32 enable = *(UINT32 *)param;
        if(enable) {
            reg &= ~GPIO_EXTRAL_INT_MASK;
            reg |= USB_PLUG_IN_INT_EN;
            REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);
        } else {
            reg &= ~GPIO_EXTRAL_INT_MASK;
            reg &= ~USB_PLUG_IN_INT_EN;
            REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);
        }
        break;
    }
    
    case CMD_GPIO_EN_USB_PLUG_OUT_INT:
    {
        INT32 reg = REG_READ(REG_GPIO_EXTRAL_INT_CFG);
        ASSERT(param);
        UINT32 enable = *(UINT32 *)param;
        if(enable) {
            reg &= ~GPIO_EXTRAL_INT_MASK;
            reg |= USB_PLUG_OUT_INT_EN;
            REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);
        } else {
            reg &= ~GPIO_EXTRAL_INT_MASK;
            reg &= ~USB_PLUG_OUT_INT_EN;
            REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);
        }
        break;
    }

#endif // (SOC_BK7221U == CFG_SOC_NAME)
#endif // (SOC_BK7231 == CFG_SOC_NAME)

    case CMD_GPIO_INT_ENABLE:
    {
        GPIO_INT_ST *ptr = param;
        gpio_int_enable(ptr->id, ptr->mode, ptr->phandler);
        break;
    }
    case CMD_GPIO_INT_DISABLE:
    {
        UINT32 id ;
        id = *(UINT32 *)param;
        gpio_int_disable(id);
        break;
    }
    default:
        break;
    }

    return ret;
}

#if(SOC_BK7221U == CFG_SOC_NAME)
UINT32 usb_is_plug_in(void)
{
    UINT32 reg = REG_READ(REG_GPIO_DETECT);

    return (reg & IS_USB_PLUG_IN_BIT)? 1 : 0;
}

void usb_plug_inout_isr(void)
{
    UINT32 reg = REG_READ(REG_GPIO_EXTRAL_INT_CFG);
    
    if(reg & USB_PLUG_IN_INT) 
    {
        reg = REG_READ(REG_GPIO_EXTRAL_INT_CFG);
        reg &= ~GPIO_EXTRAL_INT_MASK;
        reg |= USB_PLUG_IN_INT;
        REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);

        if(usb_plug.handler) {
            usb_plug.handler(usb_plug.usr_data, USB_PLUG_IN_EVENT);
        }
    }

    reg = REG_READ(REG_GPIO_EXTRAL_INT_CFG);
    if(reg & USB_PLUG_OUT_INT) 
    {
        reg = REG_READ(REG_GPIO_EXTRAL_INT_CFG);
        reg &= ~GPIO_EXTRAL_INT_MASK;
        reg |= USB_PLUG_OUT_INT;
        REG_WRITE(REG_GPIO_EXTRAL_INT_CFG, reg);

        if(usb_plug.handler) {
            usb_plug.handler(usb_plug.usr_data, USB_PLUG_OUT_EVENT);
        }
    }
}
#endif

// EOF
